In [2]:
import sqlite3
import pandas as pd

conn_teste        = sqlite3.connect('data/base_teste.db')
conn_universidade = sqlite3.connect('data/universidade.db')

def consulta(query, conn):
    return pd.read_sql(query, conn)

In [14]:
df_persons = consulta("SELECT * FROM person", conn_universidade)

In [15]:
df_persons.head()

   personid firstname middleinitial lastname dateofbirth
0         1     Adele             S  Rosales  1984-05-05
1         2    Justus             Z    Gomez  2007-04-06
2         3     Isiah             Z   Warner  1992-06-04
3         4     Erica             L   Campos  1994-05-14
4         5   Desmond             W   Valdez  1996-11-19

In [16]:
# conn = sqlite3.connect('data/base_teste.db')
# CREATE DATABASE base_teste;

In [5]:
cursor = conn_teste.cursor()

In [8]:
SQL = """
        CREATE TABLE IF NOT EXISTS person (
            personid INTEGER PRIMARY KEY AUTOINCREMENT,
            firstname TEXT,
            middleinitial TEXT,
            lastname TEXT, 
            dateofbirth TEXT
        )
      """

In [9]:
cursor.execute(SQL)

In [20]:
cursor.execute("PRAGMA table_info(person)").fetchall()

[(0, 'personid', 'INTEGER', 0, None, 1),
 (1, 'firstname', 'TEXT', 0, None, 0),
 (2, 'middleinitial', 'TEXT', 0, None, 0),
 (3, 'lastname', 'TEXT', 0, None, 0),
 (4, 'dateofbirth', 'TEXT', 0, None, 0)]

In [10]:
SQL = """
      INSERT INTO person(firstname, middleinitial, lastname, dateofbirth)
      VALUES ('Anderson', 'C', 'Cordeiro', '1986-05-06')
      """

In [11]:
cursor.execute(SQL)

In [12]:
cursor.execute("SELECT * FROM person").fetchall()

[(1, 'Anderson', 'C', 'Cordeiro', '1986-05-06')]

In [26]:
consulta('SELECT * FROM person', conn_teste)

   personid firstname middleinitial  lastname dateofbirth
0         1  Anderson             C  Cordeiro  1986-05-06

In [13]:
lista_pessoas = [
    ('Maria', 'C', 'Cordeiro', '1976-05-06'),
    ('João', 'D', 'Silva', '1966-05-06'),
    ('José', 'E', 'Abreu', '1996-05-06')
]

In [15]:
SQL = """
      INSERT INTO person(firstname, middleinitial, lastname, dateofbirth)
      VALUES (?, ?, ?, ?)
      """

In [16]:
cursor.executemany(SQL, lista_pessoas)

In [17]:
cursor.execute("SELECT * FROM person").fetchall()

[(1, 'Anderson', 'C', 'Cordeiro', '1986-05-06'),
 (2, 'Maria', 'C', 'Cordeiro', '1976-05-06'),
 (3, 'João', 'D', 'Silva', '1966-05-06'),
 (4, 'José', 'E', 'Abreu', '1996-05-06')]

In [ ]:
for pessoa in lista_pessoas:
    cursor.execute(SQL, pessoa)

In [ ]:
for pessoa in lista_pessoas:
    SQL = f"""
            INSERT INTO person(firstname, middleinitial, lastname, dateofbirth)
            VALUES ('{pessoa[0]}', '{pessoa[1]}', '{pessoa[2]}', '{pessoa[3]}')
          """
    cursor.execute(SQL)

In [20]:
import pandas as pd

In [38]:
df_person = pd.read_csv('data/SamplePersonData')

In [39]:
df_person

     personid  firstname  middleinitial  lastname  dateofbirth
0           1      Adele              S   Rosales   1984-05-05
1           2     Justus              Z     Gomez   2007-04-06
2           3      Isiah              Z    Warner   1992-06-04
3           4      Erica              L    Campos   1994-05-14
4           5    Desmond              W    Valdez   1996-11-19
..        ...        ...            ...       ...          ...
995       996      Piper              D      Dunn   1980-07-20
996       997    Emmalyn              Y      Barr   1983-09-07
997       998    Audrina              X     Solis   1994-02-24
998       999      Tyler              I   Harrell   1992-02-17
999      1000   Caroline              G     Baker   1986-04-19

[1000 rows x 5 columns]

In [40]:
df_person.to_sql('person', conn_teste, if_exists='replace')

1000

In [42]:
df_person.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   personid        1000 non-null   int64
 1    firstname      1000 non-null   object
 2    middleinitial  1000 non-null   object
 3    lastname       1000 non-null   object
 4    dateofbirth    1000 non-null   object
dtypes: int64(1), object(4)
memory usage: 39.2+ KB

In [ ]:
df_person.to_sql('new_person', conn_teste, if_exists='replace')